<?php

namespace magein\trans;
/**
 *
 * 处理图片单位像素和磅值之间的转化
 *
 *  GD1 版本中使用像素
 *  GD2 版本中使用磅值
 *  两者之间暂时没有提供具体的函数去转化，此处的值可能不是很准确，只是接近于平衡值
 *
 * Class Unit
 * @package magein\trans
 */
class Unit
{
    /**
     * key== point值
     * value==pixel值
     * @var array
     */
    private static $point = [
        '1' => '4',
        '2' => '5',
        '3' => '7',
        '4' => '8',
        '5' => '9',
        '6' => '10',
        '7' => '11',
        '8' => '12',
        '9' => '14',
        '10' => '15',
        '11' => '16',
        '12' => '17',
        '13' => '18',
        '14' => '19',
        '15' => '21',
        '16' => '22',
        '17' => '23',
        '18' => '25',
        '19' => '26',
        '20' => '27',
        '21' => '28',
        '22' => '29',
        '23' => '30',
        '24' => '32',
        '25' => '33',
        '26' => '34',
        '27' => '35',
        '28' => '36',
        '29' => '38',
        '30' => '39',
        '31' => '40',
        '32' => '41',
        '33' => '43',
        '34' => '44',
        '35' => '46',
        '36' => '47',
        '37' => '48',
        '38' => '48',
        '39' => '50',
        '40' => '51',
        '41' => '52',
        '42' => '53',
        '43' => '55',
        '44' => '56',
        '45' => '57',
        '46' => '58',
        '47' => '60',
        '48' => '62',
        '49' => '63',
        '50' => '63',
        '51' => '64',
        '52' => '67',
        '53' => '68',
        '54' => '69',
        '55' => '70',
        '56' => '71',
        '57' => '72',
        '58' => '74',
        '59' => '75',
        '60' => '76',
        '61' => '77',
        '62' => '78',
        '63' => '79',
        '64' => '81',
        '65' => '83',
        '66' => '84',
        '67' => '85',
        '68' => '86',
        '69' => '86',
        '70' => '88',
        '71' => '90',
        '72' => '91',
        '73' => '92',
        '74' => '93',
    ];

    /**
     * @param $size
     * @return false|int|string
     */
    public static function transPixelSizeToPoint($size)
    {
        $point = array_search($size, self::$point);

        if ($point) {
            return $point;
        }

        return $size;
    }

    /**
     * @param $point
     * @return mixed
     */
    public static function transPointToPixelSize($point)
    {
        if (isset(self::$point[$point])) {
            return self::$point[$point];
        }

        return $point;
    }
}